import tkinter as tk
from tkinter import ttk

class VirtualKeyboard:
    def __init__(self, master, text_widget, target_language):
        self.master = master
        self.text_widget = text_widget
        self.selected_language = tk.StringVar(value=target_language)

        self.languages = {
            'Afrikaans': self.get_english_keys,
            'Amharic': self.get_amharic_keys,
            'Arabic': self.get_arabic_keys,
            'Assamese': self.get_assamese_keys,
            'Azerbaijani': self.get_azerbaijani_keys,
            'Azerbaijani - Cyrillic': self.get_azerbaijani_cyrillic_keys,
            'Belarusian': self.get_belarusian_keys,
            'Bengali': self.get_bengali_keys,
            'Tibetan': self.get_tibetan_keys,
            'Bosnian': self.get_bosnian_keys,
            'Bulgarian': self.get_bulgarian_keys,
            'Catalan': self.get_catalan_keys,
            'Cebuano': self.get_cebuano_keys,
            'Czech': self.get_czech_keys,
            'Cherokee': self.get_cherokee_keys,
            'Welsh': self.get_welsh_keys,
            'Danish': self.get_danish_keys,
            'German': self.get_german_keys,
            'Dzongkha': self.get_dzongkha_keys,
            'Greek': self.get_greek_keys,
            'English': self.get_english_keys,
            'English - Middle': self.get_english_middle_keys,
            'Esperanto': self.get_esperanto_keys,
            'Estonian': self.get_estonian_keys,
            'Basque': self.get_basque_keys,
            'Georgian - Old': self.get_georgian_old_keys,
            'Kazakh': self.get_kazakh_keys,
            'Khmer': self.get_khmer_keys,
            'Kyrgyz': self.get_kyrgyz_keys,
            'Kurdish': self.get_kurdish_keys,
            'Lao': self.get_lao_keys,
            'Latin': self.get_latin_keys,
            'Latvian': self.get_latvian_keys,
            'Lithuanian': self.get_lithuanian_keys,
            'Malayalam': self.get_malayalam_keys,
            'Marathi': self.get_marathi_keys,
            'Macedonian': self.get_macedonian_keys,
            'Maltese': self.get_maltese_keys,
            'Malay': self.get_malay_keys,
            'Burmese': self.get_burmese_keys,
            'Nepali': self.get_nepali_keys,
            'Dutch': self.get_dutch_keys,
            'Norwegian': self.get_norwegian_keys,
            'Oriya': self.get_oriya_keys,
            'Punjabi': self.get_punjabi_keys,
            'Polish': self.get_polish_keys,
            'Portuguese': self.get_portuguese_keys,
            'Pashto': self.get_pashto_keys,
            'Romanian': self.get_romanian_keys,
            'Russian': self.get_russian_keys,
            'Sanskrit': self.get_sanskrit_keys,
            'Sinhala': self.get_sinhala_keys,
            'Slovak': self.get_slovak_keys,
            'Slovenian': self.get_slovenian_keys,
            'Spanish': self.get_spanish_keys,
            'Spanish - Old': self.get_spanish_old_keys,
            'Albanian': self.get_albanian_keys,
            'Serbian': self.get_serbian_keys,
            'Serbian - Latin': self.get_serbian_latin_keys,
            'Swahili': self.get_swahili_keys,
            'Swedish': self.get_swedish_keys,
            'Syriac': self.get_syriac_keys,
            'Tamil': self.get_tamil_keys,
            'Telugu': self.get_telugu_keys,
            'Tajik': self.get_tajik_keys,
            'Tagalog': self.get_tagalog_keys,
            'Thai': self.get_thai_keys,
            'Tigrinya': self.get_tigrinya_keys,
            'Turkish': self.get_turkish_keys,
            'Uyghur': self.get_uyghur_keys,
            'Ukrainian': self.get_ukrainian_keys,
            'Urdu': self.get_urdu_keys,
            'Uzbek': self.get_uzbek_keys,
            'Uzbek - Cyrillic': self.get_uzbek_cyrillic_keys,
            'Vietnamese': self.get_vietnamese_keys,
            'Yiddish': self.get_yiddish_keys,
            'Yoruba': self.get_yoruba_keys
        }

        self.create_widgets()

    def create_widgets(self):
        lang_label = tk.Label(self.master, text="Select Language:")
        lang_label.pack(pady=10)
        
        lang_dropdown = ttk.Combobox(self.master, textvariable=self.selected_language, values=list(self.languages.keys()))
        lang_dropdown.pack(pady=10)
        lang_dropdown.bind("<<ComboboxSelected>>", self.change_language)
        
        self.keyboard_frame = tk.Frame(self.master)
        self.keyboard_frame.pack(pady=10)
        
        self.create_keyboard(self.languages[self.selected_language.get()]())

    def create_keyboard(self, keys):
    # Clear any existing widgets in the keyboard frame
        for widget in self.keyboard_frame.winfo_children():
            widget.destroy()

        for row in keys:
            key_row = tk.Frame(self.keyboard_frame)
            key_row.pack(side=tk.TOP, pady=5)
            for key in row:
                if key == "Caps Lock":
                    button = tk.Button(key_row, text=key, width=10, font=("Arial", 14, "bold"), command=self.toggle_capslock)
                else:
                    button = tk.Button(key_row, text=key, width=5, font=("Arial", 14, "bold"), command=lambda k=key: self.insert_key(k))
                button.pack(side=tk.LEFT, padx=5)

    def insert_key(self, key):
        """Inserts the key into the text widget."""
        self.text_widget.insert(tk.INSERT, key)

    def change_language(self, event):
        self.create_keyboard(self.languages[self.selected_language.get()]())

    def toggle_capslock(self):
        for row in self.keyboard_frame.winfo_children():
            for button in row.winfo_children():
                if button.cget("text").isalpha():
                    if button.cget("text").islower():
                        button.config(text=button.cget("text").upper())
                    else:
                        button.config(text=button.cget("text").lower())

    def get_amharic_keys(self):
        return [
            ["አ", "ኡ", "ኢ", "ኣ", "ኤ", "እ", "ኦ"],
            ["ኧ", "ከ", "ኩ", "ኪ", "ካ", "ኬ", "ክ", "ኮ"],
            ["ወ", "ዉ", "ዊ", "ዋ", "ዌ", "ው", "ዎ"]
        ]

    def get_arabic_keys(self):
        return [
        ["ش", "س", "ز", "ر", "ذ", "د", "خ", "ح", "ج", "ث", "ت", "ب"],
        ["ا", "ء", "ي", "و", "ه", "ن", "م", "ل", "ك", "ق", "ف", "غ"],
        ["ع", "ظ", "ط", "ض", "ص", "ى", "ئ", "ؤ", "ة", "إ", "أ", "ٱ"],
        ["آ", "َ", "ً", "ُ", "ٌ", "ّ", "ْ", "ِ", "ٍ", "ٰ", "ٖ", "ٗ"],
        ["؟", "!", "؛", "،", ".", "ـ"]
    ]

    def get_assamese_keys(self):
        return [
        ["ক", "খ", "গ", "ঘ", "ঙ", "অ", "আ", "ই", "ঈ", "উ", "ঊ"],
        ["চ", "ছ", "জ", "ঝ", "ঞ","া", "ি", "ী", "ু", "ূ"],
        ["ট", "ঠ", "ড", "ঢ", "ণ", "ঋ", "ৠ", "ঌ", "ৡ"],
        ["এ", "ঐ", "ও", "ঔ","ত", "থ", "দ", "ধ", "ন"],
        ["ৃ", "ৄ", "ৢ", "ৣ","ে", "ৈ", "ো", "ৌ"],
        ["প", "ফ", "ব", "ভ", "ম","ৎ", "ৗ", "ঁ", "ং", "ঃ"],
        ["়", "ঽ", "য", "ৰ", "ল", "ৱ","শ", "ষ", "স", "হ", "ক্ষ"],
        ["ড়", "ঢ়", "য়"]
    ]

    def get_azerbaijani_keys(self):
        return [
            ["a", "b", "c", "ç", "d", "e", "ə", "f", "g", "ğ"],
            ["h", "x", "ı", "i", "j", "k", "q", "l", "m", "n"],
            ["o", "ö", "p", "r", "s", "ş", "t", "u", "ü", "v", "y", "z"]
        ]

    def get_azerbaijani_cyrillic_keys(self):
        return [
            ["а", "б", "в", "г", "д", "е", "ә", "ж", "з", "и"],
            ["й", "к", "л", "м", "н", "о", "ө", "п", "р", "с"],
            ["т", "у", "ү", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я"]
        ]

    def get_belarusian_keys(self):
        return [
            ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "і"],
            ["й", "к", "л", "м", "н", "о", "п", "р", "с", "т"],
            ["у", "ў", "ф", "х", "ц", "ч", "ш", "ы", "ь", "э", "ю", "я"]
        ]

    def get_bengali_keys(self):
        return [
            ["ক", "খ", "গ", "ঘ", "ঙ"],
            ["অ", "আ", "ই", "ঈ", "উ", "ঊ","চ", "ছ", "জ", "ঝ", "ঞ"],
            ["া", "ি", "ী", "ু", "ূ","ট", "ঠ", "ড", "ঢ", "ণ"],
            ["ঋ", "ৠ", "ঌ", "ৡ","এ", "ঐ", "ও", "ঔ"],
            ["ত", "থ", "দ", "ধ", "ন","ৃ", "ৄ", "ৢ", "ৣ"],
            ["ে", "ৈ", "ো", "ৌ","প", "ফ", "ব", "ভ", "ম"],
            ["ৎ", "ৗ", "ঁ", "ং", "ঃ","়", "ঽ", "য", "র", "ল"],
            ["শ", "ষ", "স", "হ", "য়","ড়", "ঢ়"]
        ]

    def get_tibetan_keys(self):
        return [
            ["ཀ", "ཁ", "ག", "ང", "ཅ", "ཆ", "ཇ", "ཉ"],             # 8 characters
            ["ཏ", "ཐ", "ད", "ན", "ྐ", "ྑ", "ྒ", "ྔ"],             # 8 characters
            ["ྕ", "ྖ", "ྗ", "ྙ", "ྟ", "ྠ", "ྡ", "ྣ","ཱ", "ི", "ཱི", "ུ", "ཱུ", "ེ", "ཻ", "ོ"],             # 8 characters
            ["ཽ", "ྲྀ", "ཷ", "ླྀ", "ཹ", "ཿ", "༔", "ཾ","ྃ", "ྂ", "ༀ", "་", "།", "༏", "༑", "༄"],             # 8 characters
            ["༅", "པ", "ཕ", "བ", "མ", "ཙ", "ཚ", "ཛ","ཝ", "ཞ", "ཟ", "འ", "ཡ", "ྤ", "ྥ", "ྦ"],             # 8 characters
            ["ྨ", "ྩ", "ྪ", "ྫ", "ྭ", "ྮ", "ྯ", "ྰ","ྱ", "ར", "ལ", "ཤ", "ས", "ཧ", "ཨ", "ྲ"],             # 8 characters
            ["ླ", "ྴ", "ྶ", "ྷ", "ྸ", "ཊ", "ཋ", "ཌ","ཎ", "ཪ", "ཥ", "ྚ", "ྛ", "ྜ", "ྞ", "ྼ","ྵ"]                                                   # 1 character
    ]

    def get_bosnian_keys(self):
        return [
            ["a", "b", "c", "č", "ć", "d", "dž", "đ", "e", "f"],
            ["g", "h", "i", "j", "k", "l", "lj", "m", "n", "nj"],
            ["o", "p", "r", "s", "š", "t", "u", "v", "z", "ž"]
        ]

    def get_bulgarian_keys(self):
        return [
            ["а", "б", "в", "г", "д", "е", "ж", "з", "и", "й"],
            ["к", "л", "м", "н", "о", "п", "р", "с", "т", "у"],
            ["ф", "х", "ц", "ч", "ш", "щ", "ъ", "ь", "ю", "я"]
        ]

    def get_catalan_keys(self):
        return [
            ["a", "à", "b", "c", "ç", "d", "e", "é", "è", "f"],
            ["g", "h", "i", "í", "ï", "j", "k", "l", "m", "n"],
            ["o", "ó", "ò", "p", "q", "r", "s", "t", "u", "ú"],
            ["ü", "v", "w", "x", "y", "z", "·"]
        ]


    def get_cebuano_keys(self):
        return [
            ["a", "b", "k", "d", "e", "g", "h", "i", "l", "m"],
            ["n", "ng", "o", "p", "r", "s", "t", "u", "w", "y"]
        ]

    def get_czech_keys(self):
        return [
            ["a", "á", "b", "c", "č", "d", "ď", "e", "é", "ě"],
            ["f", "g", "h", "ch", "i", "í", "j", "k", "l", "m"],
            ["n", "ň", "o", "ó", "p", "q", "r", "ř", "s", "š"],
            ["t", "ť", "u", "ú", "ů", "v", "w", "x", "y", "ý", "z", "ž"]
        ]


    def get_cherokee_keys(self):
        return [
            ["Ꭰ", "Ꭱ", "Ꭲ", "Ꭳ", "Ꭴ", "Ꭵ", "Ꭷ", "Ꭶ", "Ꭸ", "Ꭹ"],
            ["Ꭺ", "Ꭻ", "Ꭼ", "Ꭽ", "Ꭾ", "Ꭿ", "Ꮀ", "Ꮁ", "Ꮂ", "Ꮃ"],
            ["Ꮄ", "Ꮅ", "Ꮆ", "Ꮇ", "Ꮈ", "Ꮉ", "Ꮊ", "Ꮋ", "Ꮌ", "Ꮍ"],
            ["Ᏽ", "Ꮏ", "Ꮐ", "Ꮎ", "Ꮑ", "Ꮒ", "Ꮓ", "Ꮔ", "Ꮕ", "Ꮖ"],
            ["Ꮗ", "Ꮘ", "Ꮙ", "Ꮚ", "Ꮛ", "Ꮝ", "Ꮜ", "Ꮞ", "Ꮟ", "Ꮠ"],
            ["Ꮡ", "Ꮢ", "Ꮣ", "Ꮥ", "Ꮧ", "Ꮩ", "Ꮪ", "Ꮫ", "Ꮤ", "Ꮦ"],
            ["Ꮨ", "Ꮬ", "Ꮭ", "Ꮮ", "Ꮯ", "Ꮰ", "Ꮱ", "Ꮲ", "Ꮳ", "Ꮴ"],
            ["Ꮵ", "Ꮶ", "Ꮷ", "Ꮸ", "Ꮹ", "Ꮺ", "Ꮻ", "Ꮼ", "Ꮽ", "Ꮾ"],
            ["Ꮿ", "Ᏸ", "Ᏹ", "Ᏺ", "Ᏻ", "Ᏼ"]
        ]

    def get_welsh_keys(self):
        return [
            ["a", "b", "c", "ch", "d", "dd", "e", "f", "ff"],
            ["g", "ng", "h", "i", "j", "l", "ll", "m", "n"],
            ["o", "p", "ph", "r", "rh", "s", "t", "th", "u", "w", "y"]
        ]

    def get_danish_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i"],
            ["j", "k", "l", "m", "n", "o", "p", "q", "r"],
            ["s", "t", "u", "v", "w", "x", "y", "z", "æ", "ø", "å"]
        ]

    def get_german_keys(self):
        return [
            ["a", "ä", "b", "c", "d", "e", "f", "g", "h"],
            ["i", "j", "k", "l", "m", "n", "o", "ö", "p"],
            ["q", "r", "s", "ß", "t", "u", "ü", "v", "w", "x", "y", "z"]
        ]

    def get_dzongkha_keys(self):
        return [
            ["ཀ", "ཁ", "ག", "ང", "ཅ", "ཆ", "ཇ", "ཉ", "ཏ", "ཐ"],
            ["ད", "ན", "པ", "ཕ", "བ", "མ", "ཙ", "ཚ", "ཛ", "ཝ"],
            ["ཞ", "ཟ", "འ", "ཡ", "ར", "ལ", "ཤ", "ས", "ཧ", "ཨ"]
        ]

    def get_greek_keys(self):
        return [
            ["α", "β", "γ", "δ", "ε", "ζ", "η", "θ", "ι"],
            ["κ", "λ", "μ", "ν", "ξ", "ο", "π", "ρ", "σ"],
            ["τ", "υ", "φ", "χ", "ψ", "ω", "ς", "ΐ", "ΰ"]
        ]

    def get_english_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"],
            ["k", "l", "m", "n", "o", "p", "q", "r", "s", "t"],
            ["u", "v", "w", "x", "y", "z"]
        ]

    def get_english_middle_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"],
            ["k", "l", "m", "n", "o", "p", "q", "r", "s", "t"],
            ["u", "v", "w", "x", "y", "z"]
        ]

    def get_esperanto_keys(self):
        return [
            ["a", "b", "c", "ĉ", "d", "e", "f", "g", "ĝ", "h"],
            ["ĥ", "i", "j", "ĵ", "k", "l", "m", "n", "o", "p"],
            ["r", "s", "ŝ", "t", "u", "ŭ", "v", "z"]
        ]

    def get_estonian_keys(self):
        return [
            ["a", "b", "d", "e", "f", "g", "h", "i", "j", "k"],
            ["l", "m", "n", "o", "p", "r", "s", "š", "t", "u"],
            ["v", "z", "ž", "õ", "ä", "ö", "ü"]
        ]

    def get_basque_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k"],
            ["l", "m", "n", "o", "p", "r", "s", "t", "u"],
            ["v", "x", "z", "ñ", "ç"]
        ]

    def get_georgian_old_keys(self):
        return [
            ["Ⴀ", "Ⴁ", "Ⴂ", "Ⴃ", "Ⴄ", "Ⴅ", "Ⴆ", "Ⴇ", "Ⴈ"],
            ["Ⴉ", "Ⴊ", "Ⴋ", "Ⴌ", "Ⴍ", "Ⴎ", "Ⴏ", "Ⴐ", "Ⴑ", "Ⴒ"],
            ["Ⴓ", "Ⴔ", "Ⴕ", "Ⴖ", "Ⴗ", "Ⴘ", "Ⴙ", "Ⴚ", "Ⴛ", "Ⴜ", "Ⴝ", "Ⴞ", "Ⴟ", "Ⴠ", "Ⴡ", "Ⴢ"]
        ]

    def get_kazakh_keys(self):
        return [
            ["а", "ә", "б", "в", "г", "ғ", "д", "е", "ё", "ж", "з"],
            ["и", "й", "к", "қ", "л", "м", "н", "ң", "о", "ө", "п"],
            ["р", "с", "т", "у", "ұ", "ү", "ф", "х", "һ", "ц", "ч"],
            ["ш", "щ", "ъ", "ы", "і", "ь", "э", "ю", "я"]
        ]

    def get_khmer_keys(self):
        return [
        ["ក", "ខ", "គ", "ឃ", "ង", "្", "ា", "ិ", "ី"],
        ["ឹ", "ឺ", "ុ", "ូ", "ច", "ឆ", "ជ", "ឈ", "ញ"],
        ["ួ", "ើ", "ឿ", "ៀ", "េ", "ែ", "ៃ", "ោ", "ៅ"],
        ["ដ", "ឋ", "ឌ", "ឍ", "ណ", "ឣ", "ឤ", "ឥ", "ឦ"],
        ["ឧ", "ឨ", "ឩ", "ឪ", "ត", "ថ", "ទ", "ធ", "ន"],
        ["ឫ", "ឬ", "ឭ", "ឮ", "ឯ", "ឰ", "ឱ", "ឲ", "ឳ"],
        ["ប", "ផ", "ព", "ភ", "ម", "ំ", "ះ", "ៈ", "៉"],
        ["៊", "់", "៌", "៍", "៎", "៏", "័", "៑", "៓"],
        ["យ", "រ", "ល", "វ", "។", "៕", "៖", "ៗ", "៘"],
        ["៙", "៚", "៛", "ៜ", "៝", "ឝ", "ឞ", "ស", "ហ"],
        ["ឡ", "អ"]
    ]

    def get_kyrgyz_keys(self):
        return [    
            ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и"],
            ["й", "к", "л", "м", "н", "ң", "о", "ө", "п", "р"],
            ["с", "т", "у", "ү", "ф", "х", "ц", "ч", "ш", "щ"],
            ["ъ", "ы", "ь", "э", "ю", "я"]
]

    def get_kurdish_keys(self):
        return [
            ["ش", "س", "ژ", "ز", "ڕ", "ر", "د", "خ", "ح", "چ"],
            ["ج", "ت", "پ", "ب", "ا", "ئ", "ێ", "ی", "ۆ", "وو"],
            ["و", "ە", "ه", "ن", "م", "ڵ", "ل", "گ", "ک", "ق"],
            ["ڤ", "ف", "غ", "ع", "؟", "؛", "،", "«", "»", "‌", "ـ", "ْ", "ۊ"]
        ]

    def get_lao_keys(self):
        return [
            ["ກ", "ຂ", "ຄ", "ງ", "່", "້", "໊", "໋"],
            ["໌", "ໍ", "ຈ", "ຊ", "ຍ", "ະ", "ັ", "າ"],
            ["ຳ", "ິ", "ີ", "ຶ", "ື", "ຸ", "ູ", "ດ"],
            ["ຕ", "ຖ", "ທ", "ນ", "ບ", "ປ", "ຜ", "ຝ"],
            ["ພ", "ຟ", "ມ", "ຢ", "ຣ", "ລ", "ວ", "ສ"],
            ["ຫ", "ອ", "ຮ", "ົ", "ຼ", "ຽ", "ເ", "ແ"],
            ["ໂ", "ໃ", "ໄ", "ຯ", "ໆ"]
        ]

    def get_latin_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"],
            ["k", "l", "m", "n", "o", "p", "q", "r", "s", "t"],
            ["u", "v", "w", "x", "y", "z", "á", "ä", "â", "ã", "ç", "ð" , "Þ"]
        ]

    def get_latvian_keys(self):
        return [
            ["a", "ā", "b", "c", "č", "d", "e", "ē", "f", "g"],
            ["ģ", "h", "i", "ī", "j", "k", "ķ", "l", "ļ", "m"],
            ["n", "ņ", "o", "p", "r", "s", "š", "t", "u", "ū", "v", "z", "ž"]
        ]

    def get_lithuanian_keys(self):
        return [
            ["a", "ą", "b", "c", "č", "d", "e", "ę", "ė", "f", "g"],
            ["h", "i", "į", "j", "k", "l", "m", "n", "o", "p"],
            ["r", "s", "š", "t", "u", "ų", "ū", "v", "z", "ž"]
        ]

    def get_malayalam_keys(self):
        return [
            ["ക", "ഖ", "ഗ", "ഘ", "ങ", "്", "ച", "ഛ", "ജ", "ഝ", "ഞ", "ഞ", "ട", "ഠ", "ഡ", "ഢ", "ണ"],
            ["ത", "ഥ", "ദ", "ധ", "ന", "പ", "ഫ", "ബ", "ഭ", "മ", "യ", "ര", "ല", "ല", "വ", "ശ", "ഷ"],
            ["സ", "ഹ", "ള", "ഴ", "റ", "ഩ", "ഺ", "ൺ", "ൻ", "ർ", "ൽ", "ൾ", "ൿ", "ൔ", "ൕ", "ൖ"],
            ["അ", "ആ", "ഇ", "ഈ", "ഉ", "ഊ", "ാ", "ി", "ീ", "ു", "ൂ", "ഋ", "ൠ", "ഌ", "ൡ", "എ"],
            ["ഏ", "ഐ", "ഒ", "ഓ", "ഔ", "ൃ", "ൄ", "ൢ", "ൣ", "െ", "േ", "ൈ", "ൊ", "ോ", "ൌ", "ൗ"],
            ["ഁ", "ഁ", "ം", "ഀ", "ഃ", "഻", "഼", "ൎ", "ഽ", "ഄ"]
    ]

    def get_marathi_keys(self):
        return [
            ["१", "२", "३", "४", "५", "६", "७", "८", "९", "०", "-", "ृ", "ौ", "ै", "ा", "ी"],
            ["ू", "ब", "ह", "ग", "द", "ज", "ड", "़", "ॉ", "ो", "े", "्", "ि", "ु", "प", "र"],
            ["क", "त", "च", "ट", "ॉ", "ं", "म", "न", "व", "ल", "स", "य", "ऍ", "ॅ", "ऋ", "औ"],
            ["ऐ", "आ", "ई", "ऊ", "भ", "ङ", "घ", "ध", "झ", "ढ", "ञ", "ऑ", "ओ", "ए", "अ", "इ"],
            ["उ", "फ", "ऱ", "ख", "थ", "छ", "ठ", "ऑँ", "ण", "ळ", "श", "ष", "।", "य़"]
    ]


    def get_macedonian_keys(self):
        return [
            ["а", "б", "в", "г", "д", "ѓ", "е", "ж", "з", "ѕ"],
            ["и", "ј", "к", "л", "љ", "м", "н", "њ", "о", "п"],
            ["р", "с", "т", "ќ", "у", "ф", "х", "ц", "ч", "џ", "ш"]
        ]

    def get_maltese_keys(self):
        return [
            ["a", "b", "c", "ċ", "d", "e", "f", "g", "ġ", "h"],
            ["ħ", "i", "j", "k", "l", "m", "n", "o", "p"],
            ["q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "ż"]
        ]

    def get_malay_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l"],
            ["m", "n", "o", "p", "q", "r", "s", "t", "u", "v"],
            ["w", "x", "y", "z"]
        ]

    def get_burmese_keys(self):
        return [
            ["က", "ခ", "ဂ", "ဃ", "င","စ", "ဆ", "ဇ", "ဈ", "ဉ", "ည"],
            ["ဋ", "ဌ", "ဍ", "ဎ", "ဏ","တ", "ထ", "ဒ", "ဓ", "န"],
            ["ပ", "ဖ", "ဗ", "ဘ", "မ", "ယ", "ရ", "လ", "ဠ", "ဝ"],
            ["ဟ", "သ", "ဿ", "ျ", "ြ","ွ", "ှ", "္", "အ", "ဣ"],
            ["ဤ", "ဥ", "ဦ", "ဧ", "ဩ","ဪ", "ေ", "ဲ", "ံ", "့"],
            ["း", "်", "်", "၊", "။","၌", "၍", "၎", "၏"]
    ]

    def get_nepali_keys(self):
        return [
        ['ञ', 'घ', 'ङ', 'झ', 'छ', 'ट', 'ठ', 'ड', 'ढ', 'ण', 'ध', 'भ', 'च', 'त', 'थ', 'ग', 'ष', 'य'],
        ['उ', 'ृ', 'े', 'ब', 'क', 'म', 'ा', 'न', 'ज', 'व', 'प', 'ि', 'स', 'ु', 'श', 'ह', 'अ', 'ख'],
        ['द', 'ल', 'फ', ',', '।', 'र', '१', '२', '३', '४', '५', '६', '७', '८', '९', '०', 'इ', 'ए'],
        ['ो', 'ँ', 'ी', 'ू', 'ै', 'ऋ', 'ऋ', '?']
    ]

    def get_dutch_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k"],
            ["l", "m", "n", "o", "p", "q", "r", "s", "t", "u"],
            ["v", "w", "x", "y", "z", "á", "à", "ä", "é", "è", "ê" ],
            ["ë", "í", "ï", "ĳ", "ó", "ö", "ú", "ü"]
        ]

    def get_norwegian_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i"],
            ["j", "k", "l", "m", "n", "o", "p", "q", "r"],
            ["s", "t", "u", "v", "w", "x", "y", "z", "æ", "ø", "å"]
        ]

    def get_oriya_keys(self):
        return [
        ['କ', 'ଖ', 'ଗ', 'ଘ', 'ଙ', 'ଚ', 'ଛ', 'ଜ', 'ଝ', 'ଞ', 'ଟ', 'ଠ', 'ଡ', 'ଢ', 'ଣ', 'ତ', 'ଥ', 'ଦ', 'ଧ', 'ନ'], 
        ['ପ', 'ଫ', 'ବ', 'ଭ', 'ମ', 'ଯ', 'ର', 'ଲ', 'ଳ', 'ଵ', 'ଶ', 'ଷ', 'ସ', 'ହ', 'ୟ', 'ଡ଼', 'ଢ଼', 'ୱ'], 
        ['ଅ', 'ଆ', 'ଇ', 'ଈ', 'ଈ', 'ଉ', 'ଉଉ', 'ା', 'ି', 'ୀ', 'ୁ', 'ୂ', 'ଋ', 'ୠ', 'ଌ', 'ୡ', 'ଏ', 'ଐ', 'ଓ', 'ଔ'], 
        ['ୃ', 'ୄ', 'ୢ', 'ୣ', 'େ', 'ୈ', 'ୋ', 'ୌ', 'ୖ', 'ୗ', 'ଡ଼', 'ଁ', 'ଂ', 'ଃ', '଼', 'ଽ', '୦'], 
        ['୧', '୨', '୩', '୪', '୫', '୫', '୬', '୭', '୮', '୯']
    ]

    def get_punjabi_keys(self):
        return [
        ['ਕ', 'ਖ', 'ਗ', 'ਘ', 'ਙ', 'ਚ', 'ਛ', 'ਜ', 'ਝ', 'ਞ', 'ਟ', 'ਠ', 'ਡ', 'ਢ', 'ਣ', 'ਤ', 'ਥ', 'ਦ', 'ਧ', 'ਨ'], 
        ['ਪ', 'ਫ', 'ਬ', 'ਭ', 'ਮ', 'ਯ', 'ਰ', 'ਲ', 'ਲ਼', 'ਵ', 'ਸ਼', 'ਸ', 'ਹ', 'ਖ਼', 'ਗ਼', 'ਜ਼', 'ੜ', 'ਫ਼'], 
        ['ਅ', 'ਆ', 'ਇ', 'ਈ', 'ਉ', 'ਊ', 'ਾ', 'ਿ', 'ੀ', 'ੁ', 'ੂ', 'ਏ', 'ਐ', 'ਓ', 'ਔ', 'ੇ', 'ੈ', 'ੋ', 'ੌ'], 
        ['ੑ', 'ਁ', 'ਂ', 'ਃ', '਼', 'ੰ', 'ੱ', '੦', '੧', '੨', '੩', '੪', '੫', '੬', '੭', '੮', '੯']
    ]

    def get_polish_keys(self):
        return [
            ["a", "ą", "b", "c", "ć", "d", "e", "ę", "f", "g"],
            ["h", "i", "j", "k", "l", "ł", "m", "n", "ń", "o", "ó"],
            ["p", "q", "r", "s", "ś", "t", "u", "v", "w", "x", "y", "z", "ź", "ż"]
        ]

    def get_portuguese_keys(self):
        return [
            ["a", "á", "â","à", "ã", "b", "c", "ç", "d", "e", "é", "ê"],
            ["f", "g", "h", "i", "í", "j", "k", "l", "m", "n"],
            ["o", "ó", "ô", "õ", "p", "q", "r", "s", "t", "u","ü", "ú", "v", "w", "x", "y", "z"]
        ]

    def get_pashto_keys(self):
        return [
        ['ږ', 'ژ', 'ز', 'ړ', 'ر', 'ذ', 'ډ', 'د', 'خ', 'ح', 'څ', 'چ', 'ځ', 'ج', 'ث', 'ټ', 'ت', 'پ', 'ب', 'ا'],
        ['ڼ', 'ن', 'م', 'ل', 'ګ', 'ک', 'ق', 'ف', 'غ', 'ع', 'ظ', 'ط', 'ض', 'ص', 'ښ', 'ش', 'س', '؟', '؛', '،', 'ـ'],
        ['َ', 'ٙ', 'ِ', 'ُ', 'ء', 'ے', 'ئ', 'ې', 'ی', 'ه', 'و', '۰', '۱', '۲', '۳', '۴', '۵', '۶', '۷', '۸', '۹']
    ]

    def get_romanian_keys(self):
        return [
            ["a", "ă", "â", "b", "c", "d", "e", "f", "g"],
            ["h", "i", "î", "j", "k", "l", "m", "n", "o"],
            ["p", "q", "r", "s", "ș", "t", "ț", "u", "v", "w", "x", "y", "z"]
        ]

    def get_russian_keys(self):
        return [
        ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т'],
        ['у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я', 'і', 'ѣ', 'ѳ', 'ѵ']
    ]

    def get_sanskrit_keys(self):
        return [
        ['क', 'ख', 'ग', 'घ', 'ङ', 'च', 'छ', 'ज', 'झ', 'ञ', 'ट', 'ठ', 'ड', 'ढ', 'ण', 'त', 'थ', 'द', 'ध', 'न'], 
        ['प', 'फ', 'ब', 'भ', 'म', 'य', 'र', 'ल', 'व', 'श', 'ष', 'स', 'ह', '्', 'अ', 'आ', 'इ', 'ई', 'उ', 'ऊ'], 
        ['ा', 'ि', 'ी', 'ु', 'ू', 'ऋ', 'ॠ', 'ऌ', 'ॡ', 'ए', 'ऐ', 'ओ', 'औ', 'ृ', 'ॄ', 'ॢ', 'ॣ', 'े', 'ै', 'ो', 'ौ'],
        ['॑', '॒', '॓', '॔', 'ँ', 'ं', 'ः', '़', '।', '॥', 'ऽ', '॰', 'ॐ', '०', '१', '२', '३', '४', '५', '६', '७', '८', '९']
    ]

    def get_sinhala_keys(self):
        return [
        ['ක', 'ඛ', 'ග', 'ඝ', 'ඞ', 'ඟ', 'ච', 'ඡ', 'ජ', 'ඣ', 'ඤ', 'ඥ', 'ඦ', 'ට', 'ඨ', 'ඩ', 'ඪ', 'ණ', 'ඬ', 'ත'], 
        ['ථ', 'ද', 'ධ', 'න', 'ඳ', 'ප', 'ඵ', 'බ', 'භ', 'ම', 'ඹ', 'ය', 'ර', 'ල', 'ළ', 'ව', 'හ', 'ශ', 'ෂ', 'ස'], 
        ['ෆ', '‍ය', '‍ර', 'ක්‍ෂ', '‍', 'අ', 'ආ', 'ඇ', 'ඈ', 'ඉ', 'ඊ', 'උ', 'ඌ', 'ා', 'ැ', 'ෑ', 'ි', 'ී', 'ු', 'ූ'], 
        ['ෙ', 'ේ', 'ෛ', 'ො', 'ෝ', 'ෞ', 'ෘ', 'ෲ', 'ෳ', 'ං', 'ඃ', '෴']
    ]

    def get_slovak_keys(self):
        return [
            ["a", "á", "ä", "b", "c", "č", "d", "ď", "e", "é", "f"],
            ["g", "h", "ch", "i", "í", "j", "k", "l", "ľ", "ĺ", "m"],
            ["n", "ň", "o", "ó", "ô", "p", "q", "r", "ŕ", "s", "š", "t", "ť", "u", "ú", "v", "w", "x", "y", "ý", "z", "ž"]
        ]

    def get_slovenian_keys(self):
        return [
            ["a", "á", "ä",  "b", "c", "č", "d","ď", "e","é", "f", "g", "h", "i"],
            ["í","ĺ","ľ","j", "k", "l", "m", "n","ň", "o", "ó", "ô", "p", "r","ŕ", "s", "š"],
            ["t", "ť", "ú" , "u", "v", "ý", "z", "ž"]
        ]

    def get_spanish_keys(self):
        return [
            ["a", "á", "b", "c", "d", "e", "é", "f", "g", "h"],
            ["i", "í", "j", "k", "l", "m", "n", "ñ", "o", "ó", "p"],
            ["q", "r", "s", "t", "u", "ú", "v", "w", "x", "y", "z"]
        ]

    def get_spanish_old_keys(self):
        return [
            ["a","á", "b", "c", "d", "e","é", "f", "g", "h", "i", "í","j"],
            ["k", "l", "m", "n", "ñ", "o", "ó", "p", "q", "r", "s"],
            ["t", "u","ú", "ü", "v", "w", "x", "y", "z"]
        ]

    def get_albanian_keys(self):
        return [
            ["a", "b", "c", "ç", "d", "dh", "e", "ë", "f", "g"],
            ["gj", "h", "i", "j", "k", "l", "ll", "m", "n", "nj"],
            ["o", "p", "q", "r", "rr", "s", "sh", "t", "th", "u", "v", "x", "xh", "y", "z", "zh"]
        ]

    def get_serbian_keys(self):
        return [
            ["а", "б", "в", "г", "д", "ђ", "е", "ж", "з", "и"],
            ["ј", "к", "л", "љ", "м", "н", "њ", "о", "п", "р"],
            ["с", "т", "ћ", "у", "ф", "х", "ц", "ч", "џ", "ш"]
        ]

    def get_serbian_latin_keys(self):
        return [
            ["a", "b", "c", "č", "ć", "d", "dž", "đ", "e", "f"],
            ["g", "h", "i", "j", "k", "l", "lj", "m", "n", "nj"],
            ["o", "p", "r", "s", "š", "t", "u", "v", "z", "ž"]
        ]

    def get_swahili_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"],
            ["k", "l", "m", "n", "o", "p", "r", "s", "t", "u"],
            ["v", "w", "y", "z"]
        ]

    def get_swedish_keys(self):
        return [
            ["a", "b", "c", "d", "e", "f", "g", "h", "i"],
            ["j", "k", "l", "m", "n", "o", "p", "q", "r"],
            ["s", "t", "u", "v", "w", "x", "y", "z", "å", "ä", "ö"]
        ]

    def get_syriac_keys(self):
        return [
            ["ܐ", "ܒ", "ܓ", "ܕ", "ܗ", "ܘ", "ܙ", "ܚ", "ܛ", "ܝ"],
            ["ܟ", "ܠ", "ܡ", "ܢ", "ܣ", "ܥ", "ܦ", "ܨ", "ܩ", "ܪ"],
            ["ܫ", "ܬ"]
        ]

    def get_tamil_keys(self):
        return [
        ['க', 'ங', 'ச', 'ஞ', 'ட', 'ண', 'த', 'ந', 'ப', 'ம', 'ய', 'ர', 'ல', 'வ', 'ழ', 'ள', 'ற', 'ன', 'ஜ', 'ஶ'],
        ['ஷ', 'ஸ', 'ஹ', '்', 'அ', 'ஆ', 'இ', 'ஈ', 'உ', 'ஊ', 'ா', 'ி', 'ீ', 'ு', 'ூ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ'],
        ['ஔ', 'ெ', 'ே', 'ை', 'ொ', 'ோ', 'ௌ', 'ௗ', 'ஂ', 'ஃ', 'ௐ', '௦', '௧', '௨', '௩', '௪', '௫', '௬', '௭', '௮'],
        ['௯', '௰', '௱', '௲', '௳', '௴', '௵', '௹']
    ]

    def get_telugu_keys(self):
        return [
        ['క', 'ఖ', 'గ', 'ఘ', 'ఙ', 'చ', 'ఛ', 'జ', 'ఝ', 'ఞ', 'ట', 'ఠ', 'డ', 'ఢ', 'ణ', 'త', 'థ', 'ద', 'ధ', 'న'], 
        ['ప', 'ఫ', 'బ', 'భ', 'మ', 'య', 'ర', 'ఱ', 'ల', 'ళ', 'వ', 'శ', 'ష', 'స', 'హ', 'ఴ', 'ౘ', 'ౙ', 'ౚ', 'ౝ'], 
        ['్', 'అ', 'ఆ', 'ఇ', 'ఈ', 'ఉ', 'ఊ', 'ా', 'ి', 'ీ', 'ు', 'ూ', 'ఋ', 'ౠ', 'ఌ', 'ౡ', 'ఎ', 'ఏ', 'ఐ', 'ఒ'], 
        ['ఓ', 'ఔ', 'ృ', 'ౄ', 'ౢ', 'ౣ', 'ె', 'ే', 'ై', 'ొ', 'ో', 'ౌ', 'ౕ', 'ౖ', 'ఀ', 'ఁ', 'ం', 'ః', '఼', 'ఽ'], 
        ['।', '॥', '౷', '౦', '౧', '౨', '౩', '౪', '౫', '౬', '౭', '౮', '౯']
    ]

    def get_tajik_keys(self):
        return [
        ['а', 'б', 'в', 'г', 'ғ', 'д', 'е', 'ё', 'ж', 'з', 'и', 'ӣ', 'й', 'к', 'қ', 'л', 'м', 'н', 'о'], 
        ['п', 'р', 'с', 'т', 'у', 'ӯ', 'ф', 'х', 'ҳ', 'ч', 'ҷ', 'ш', 'ъ', 'э', 'ю', 'я']
    ]

    def get_tagalog_keys(self):
        return [
        ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'ng', 'o', 'p', 'q', 'r', 's'], 
        ['t', 'u', 'v', 'w', 'x', 'y', 'z', 'á', 'é', 'í', 'ó', 'ú', 'ñ', ' ']
    ]

    def get_thai_keys(self):
        return [
            ["ๆ", "ไ", "ำ", "พ", "ะ", "ั", "ี", "ร", "น", "ย", "บ", "ล", "ฃ"],
            ["ฟ", "ห", "ก", "ด", "เ", "้", "่", "า", "ส", "ว", "ง"],
            ["ผ", "ป", "แ", "อ", "ิ", "ื", "ท", "ม", "ใ", "ฝ", "ช"],
            ["โ", "ุ", "ู", "ึ", "่", "้", "๊", "๋", "ฤ", "ค", "ฦ", "ภ", "ถ", "ฌ", "ต"],
            ["ข", "ค", "ฅ", "ฆ", "จ", "ฉ", "ซ", "ญ", "ฎ", "ฏ", "ฐ", "ฑ"],
            [ "ฒ", "ณ", "ธ", "ฝ", "ศ", "ษ", "ฬ", "อ", "ฮ"]
        ]

    def get_tigrinya_keys(self):
        return [
        ['ሀ', 'ሁ', 'ሂ', 'ሃ', 'ሄ', 'ህ', 'ሆ', 'ለ', 'ሉ', 'ሊ', 'ላ', 'ሌ', 'ል', 'ሎ', 'ሏ', 'ሐ', 'ሑ', 'ሒ', 'ሓ', 'ሔ', 'ሕ', 'ሖ', 'ሗ'], 
        ['መ', 'ሙ', 'ሚ', 'ማ', 'ሜ', 'ም', 'ሞ', 'ሟ', 'ረ', 'ሩ', 'ሪ', 'ራ', 'ሬ', 'ር', 'ሮ', 'ሯ', 'ሰ', 'ሱ', 'ሲ', 'ሳ', 'ሴ', 'ስ'], 
        ['ሶ', 'ሷ', 'ሸ', 'ሹ', 'ሺ', 'ሻ', 'ሼ', 'ሽ', 'ሾ', 'ሿ', 'ቀ', 'ቁ', 'ቂ', 'ቃ', 'ቄ', 'ቅ', 'ቆ', 'ቇ', 'ቐ', 'ቑ', 'ቒ', 'ቓ'], 
        ['ቔ', 'ቕ', 'ቖ', 'በ', 'ቡ', 'ቢ', 'ባ', 'ቤ', 'ብ', 'ቦ', 'ቧ', 'ቨ', 'ቩ', 'ቪ', 'ቫ', 'ቬ', 'ቭ', 'ቮ', 'ቯ', 'ተ', 'ቱ', 'ቲ'], 
        ['ታ', 'ቴ', 'ት', 'ቶ', 'ቷ', 'ቸ', 'ቹ', 'ቺ', 'ቻ', 'ቼ', 'ች', 'ቾ', 'ቿ', 'ነ', 'ኑ', 'ኒ', 'ና', 'ኔ', 'ን', 'ኖ', 'ኗ', 'ኘ'], 
        ['ኙ', 'ኚ', 'ኛ', 'ኜ', 'ኝ', 'ኞ', 'ኟ', 'አ', 'ኡ', 'ኢ', 'ኣ', 'ኤ', 'እ', 'ኦ', 'ኧ', 'ቈ', 'ቊ', 'ቋ', 'ቌ', 'ቍ', 'ቘ', 'ቚ'], 
        ['ቛ', 'ቜ', 'ቝ', 'ኰ', 'ኲ', 'ኳ', 'ኴ', 'ኵ', 'ዀ', 'ዂ', 'ዃ', 'ዄ', 'ዅ', 'ጐ', 'ጒ', 'ጓ', 'ጔ', 'ጕ', 'ከ', 'ኩ', 'ኪ', 'ካ'], 
        ['ኬ', 'ክ', 'ኮ', 'ኯ', 'ኸ', 'ኹ', 'ኺ', 'ኻ', 'ኼ', 'ኽ', 'ኾ', 'ወ', 'ዉ', 'ዊ', 'ዋ', 'ዌ', 'ው', 'ዎ', 'ዐ', 'ዑ', 'ዒ', 'ዓ'], 
        ['ዔ', 'ዕ', 'ዖ', 'ዘ', 'ዙ', 'ዚ', 'ዛ', 'ዜ', 'ዝ', 'ዞ', 'ዟ', 'ዠ', 'ዡ', 'ዢ', 'ዣ', 'ዤ', 'ዥ', 'ዦ', 'ዧ', 'የ', 'ዩ', 'ዪ'], 
        ['ያ', 'ዬ', 'ይ', 'ዮ', 'ደ', 'ዱ', 'ዲ', 'ዳ', 'ዴ', 'ድ', 'ዶ', 'ዷ', 'ጀ', 'ጁ', 'ጂ', 'ጃ', 'ጄ', 'ጅ', 'ጆ', 'ጇ', 'ገ', 'ጉ'], 
        ['ጊ', 'ጋ', 'ጌ', 'ግ', 'ጎ', 'ጏ', 'ጠ', 'ጡ', 'ጢ', 'ጣ', 'ጤ', 'ጥ', 'ጦ', 'ጧ', 'ጨ', 'ጩ', 'ጪ', 'ጫ', 'ጬ', 'ጭ', 'ጮ', 'ጯ'], 
        ['ጰ', 'ጱ', 'ጲ', 'ጳ', 'ጴ', 'ጵ', 'ጶ', 'ጷ', 'ጸ', 'ጹ', 'ጺ', 'ጻ', 'ጼ', 'ጽ', 'ጾ', 'ጿ', 'ፈ', 'ፉ', 'ፊ', 'ፋ', 'ፌ'], 
        ['ፍ', 'ፎ', 'ፏ', 'ፐ', 'ፑ', 'ፒ', 'ፓ', 'ፔ', 'ፕ', 'ፖ', 'ፗ', '፡', '።', '፣', '፤', '፥', '፦', '፧', '፨', '፠']
    ]

    def get_turkish_keys(self):
        return [
            ["a", "â", "â", "ı", "i", "b", "c", "ç", "d", "e", "f", "g", "ğ", "h"],
            ["ı", "i", "î" "j", "k", "l", "m", "n", "o", "ö"],
            ["p", "r", "s", "ş", "t", "u", "ü", "û", "v", "y", "z"]
        ]

    def get_uyghur_keys(self):
        return [
        ['ف', 'غ', 'ش', 'س', 'ژ', 'ز', 'ر', 'د', 'خ', 'چ', 'ج', 'ت', 'پ', 'ب', 'ا', 'ئ', 'ې', 'ى', 'ي'], 
        ['ۋ', 'ۈ', 'ۇ', 'ۆ', 'و', 'ە', 'ھ', 'ن', 'م', 'ل', 'گ', 'ڭ', 'ك', 'ق', '؟', '؛', '،'], 
        ['٠', '١', '٢', '٣', '٤', '٥', '٦', '٧', '٨', '٩']
    ]

    def get_ukrainian_keys(self):
        return [
        ['а', 'б', 'в', 'г', 'ґ', 'д', 'е', 'є', 'ж', 'з', 'и', 'і', 'ї', 'й', 'к', 'л', 'м', 'н', 'о'],
        ['п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ю', 'я', 'ʼ', 'ь']
    ]
    def get_urdu_keys(self):
        return [
        ['ش', 'س', 'ژ', 'ز', 'ڑ', 'ر', 'ذ', 'ڈ', 'د', 'خ', 'ح', 'چ', 'ج', 'ث', 'ٹ', 'ت', 'پ', 'ب', 'آ', 'ا'], 
        ['ے', 'ی', 'ھ', 'ہ', 'و', 'ں', 'ن', 'م', 'ل', 'گ', 'ک', 'ق', 'ف', 'غ', 'ع', 'ظ', 'ط', 'ض', 'ص', 'ء'],
        ['ۓ', 'ئ', 'ؤ', 'ړ', 'ڐ', 'ٿ', '٘', 'ً', 'َ', 'ُ', 'ِ', 'ٰ', 'ٗ', 'ّ', '؟', '!', '؛', '،', '۔', 'ـ'],
        ['۰', '۱', '۲', '۳', '۴', '۵', '۶', '۷', '۸', '۹']
    ]

    def get_uzbek_keys(self):
        return [
        ['а', 'б', 'ч', 'д', 'э', 'ф', 'г', 'ғ', 'ҳ', 'и', 'ж', 'к', 'қ', 'л', 'м', 'н', 'о', 'ў', 'п', 'р'], 
        ['с', 'ш', 'т', 'у', 'в', 'х', 'й', 'з', 'ъ', 'ё', 'ю', 'я', 'ц']
    ]

    def get_uzbek_cyrillic_keys(self):
        return [
            ["а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и"],
            ["й", "к", "л", "м", "н", "о", "п", "р", "с", "т"],
            ["у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "э", "ю", "я"]
        ]

    def get_vietnamese_keys(self):
        return [
            ["a", "á", "à", "ả", "ã", "ạ", "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ", "â", "ấ", "ầ", "ẩ", "ẫ", "ậ"],
            ["e", "é", "è", "ẻ", "ẽ", "ẹ", "ê", "ế", "ề", "ể", "ễ", "ệ"],
            ["i", "í", "ì", "ỉ", "ĩ", "ị"],
            ["o", "ó", "ò", "ỏ", "õ", "ọ", "ô", "ố", "ồ", "ổ", "ỗ", "ộ", "ơ", "ớ", "ờ", "ở", "ỡ", "ợ"],
            ["u", "ú", "ù", "ủ", "ũ", "ụ", "ư", "ứ", "ừ", "ử", "ữ", "ự"],
            ["y", "ý", "ỳ", "ỷ", "ỹ", "ỵ"]
        ]

    def get_yiddish_keys(self):
        return [
        ['ך', 'כּ', 'ײַ', 'ײ', 'י', 'ט', 'ח', 'ז', 'ױ', 'װ', 'ו', 'ה', 'ד', 'ג', 'בֿ', 'ב', 'אָ', 'אַ', 'ך', 'יִ'],
        ['וֹ', 'וּ', 'בּ', 'א', 'ת', 'תּ', 'שׂ', 'ש', 'ר', 'ק', 'ץ', 'ף', 'פּ', 'ע', 'ס', 'ן', 'מ', 'ל', 'ץ'],
        ['ף', 'פ', 'ן', 'ם']
    ]

    def get_yoruba_keys(self):
        return [
        ['a', 'á', 'à', 'e', 'é', 'è', 'ẹ', 'ẹ́', 'ẹ̀', 'i'], 
        ['í', 'ì', 'n', 'ń', 'ǹ', 'o', 'ó', 'ò'],
        ['ọ', 'ọ́', 'ọ̀', 'ṣ', 'u', 'ú', 'ù']
    ]

if __name__ == "__main__":
    root = tk.Tk()
    app = VirtualKeyboard(root)
    root.mainloop()
